Repository: brianhlin/htcondor
Catalog: debian/po/*.po
Languages: fr

source: Condor configuration
fr: Configuration de Condor

source: Manage initial Condor configuration automatically?
fr: Faut-il gérer la configuration initiale de Condor automatiquement ?

source: The setup for Condor can be handled automatically, asking a few questions to create an initial configuration appropriate for a machine that is either a member of an existing pool or a fully functional "Personal Condor installation". This generated initial configuration can be further extended later on.
fr: La mise en place de Condor peut être gérée automatiquement en répondant à quelques questions afin de créer une configuration initiale appropriée pour une machine qui est soit membre d'un groupement (« pool ») existant, soit une « installation personnelle de Condor » complètement fonctionnelle. Cette configuration initiale générée peut être par la suite modifiée.

source: Otherwise, Condor will be installed with a default configuration that needs to be customized manually.
fr: Dans le cas contraire, Condor sera installé avec une configuration par défaut qu'il est conseillé d'adapter manuellement.

source: Enable submission of usage statistics?
fr: Faut-il activer l'inscription des statistiques d'utilisation ?

source: The Condor authors politely request that each Condor pool sends them periodic updates with basic information about the status of the pool. Updates include only the total number of machines, the number of jobs submitted, the number of machines running jobs, the host name of the central manager, and the name of the pool. These updates help the Condor Team see how Condor is being used around the world.
fr: Les auteurs de Condor suggèrent que chaque groupement de Condor leur envoie régulièrement des informations basiques à propos de l'état du groupement. Ces informations incluent le nombre total de machines, le nombre de travaux soumis, le nombre de machines exécutant des travaux, le nom d'hôte du gestionnaire central et le nom du groupement. Elles permettent à l'équipe de Condor de savoir comment leur logiciel est utilisé à travers le monde.

source: Address of the central manager:
fr: Adresse du gestionnaire central :

source: If this machine is intended to join an existing Condor pool, the address of the central manager machine has to be specified. Any address format supported by Condor can be used, including macro expressions.
fr: Si cette machine doit rejoindre un groupement Condor existant, il est alors nécessaire d'indiquer l'adresse de la machine faisant office de gestionnaire central. Tout format d'adresse géré par Condor peut être utilisé en incluant des macros.

source: Example: condor-manager.example.org
fr: Exemple : condor-manager.example.org

source: Job submission
fr: Soumission de travail

source: Job execution
fr: Exécution de travail

source: Central manager
fr: Gestionnaire central

source: Role of this machine in the Condor pool:
fr: Rôle de cette machine au sein du groupement Condor :

source: Please specify the intended role or roles of this machine, for which the corresponding daemons will be started automatically.
fr: Veuillez indiquer le(s) rôle(s) prévu(s) pour cette machine afin que les démons correspondant soient démarrés automatiquement.

source: A machine in a Condor pool can have multiple roles. In general there is one central manager and multiple nodes that run jobs. Often the central manager is also the machine from which users submit jobs. However, it is also possible to have multiple machines available for job submission.
fr: Une machine dans un groupement Condor peut avoir différents rôles. En général, il y a un gestionnaire central et plusieurs nœuds qui exécutent des travaux. Il arrive souvent que le gestionnaire central soit aussi la machine depuis laquelle les utilisateurs soumettent leurs travaux. Toutefois, il est aussi possible d'avoir plusieurs machines disponibles pour la soumission de travaux.

source: Email address of the local Condor administrator:
fr: Adresse électronique de l'administrateur local de Condor :

source: The Condor administrator will receive error messages if something goes wrong with Condor on this machine.
fr: L'administrateur de Condor recevra les messages d'erreur en cas de problème avec Condor sur cette machine.

source: user directory domain label:
fr: Étiquette de domaine du répertoire utilisateur :

source: This label is a string that Condor uses to decide if a submitting machine and an execute machine share the same directory of user accounts (that is, whether UID 1000 on one machine is the same person as UID 1000 on the other). If the labels on the two machines match, Condor will run each job under the UID that submitted the job, and send emails about them to user@DOMAIN (using this label as the value of DOMAIN). If not, Condor will run all jobs as user "nobody". Leaving it blank will cause Condor to run all jobs on this machine as user "nobody".
fr: Cette étiquette est une chaîne de caractères que Condor utilise pour décider si une machine qui soumet un travail et une machine qui exécute le travail partagent le même répertoire d'un compte utilisateur (c'est-à-dire si l'UID 1000 d'une machine est la même personne que l'UID 1000 d'une autre machine). Si les étiquettes des deux machines correspondent, Condor exécutera chaque travail sous l'UID qui a soumis le travail et enverra un message électronique à l'adresse utilisateur@DOMAINE (en utilisant l'étiquette comme valeur pour DOMAINE). Dans le cas contraire, Condor exécutera tous les travaux en tant qu'utilisateur « nobody ». Si vous laissez ce champ vide, Condor exécutera tous les travaux en tant qu'utilisateur « nobody ».

source: Any domain format supported by Condor can be used, including macro expressions. Example: $(FULL_HOSTNAME)
fr: Tout format de domaine géré par Condor peut être utilisé en incluant des macros. Exemple : $(NOM_DHOTE_COMPLET)

source: File system domain label:
fr: Étiquette de domaine du système de fichiers :

source: This label is an arbitrary string that is used to decide if a submitting machine and an execute machine share the same file system. In a dedicated cluster all machines will most likely use a shared file system and hence should use the same label. If left blank, it will automatically be set to the fully qualified hostname of the local machine, which will prevent Condor assuming that any two machines share a file system.
fr: Cette étiquette est une chaîne de caractères aléatoire qui est utilisée pour décider si une machine qui soumet un travail et une machine qui exécute un travail partagent un même système de fichiers. Dans une grappe dédiée de machines, il est fort probable que toutes les machines utilisent un système de fichiers partagé et par conséquent elles devraient utiliser la même étiquette. Si vous laissez ce champ vide, le nom d'hôte complètement qualifié de la machine locale sera utilisé, ce qui empêchera Condor de supposer que des machines prises deux à deux partagent le même système de fichiers.

source: Example: my_shared_volume
fr: Exemple : mon_volume_partagé

source: Perform a "Personal Condor installation"?
fr: Faut-il effectuer une « installation personnelle de Condor » ?

source: A Personal Condor installation is a fully functional Condor pool on a single machine. Condor will automatically configure and advertise as many slots as it detects CPU cores on this machine. Condor daemons will not be available through external network interfaces.
fr: Une « installation personnelle de Condor » est un groupement de Condor autonome sur une seule machine. Condor configurera et annoncera automatiquement autant de créneaux (« slots ») que de cœurs CPU détectés sur cette machine. Les démons de Condor ne seront pas disponibles pour des interfaces réseau externes.

source: This configuration is not appropriate if this machine is intended to be a member of a pool.
fr: Cette configuration n'est pas adaptée si cette machine est prévue pour être membre d'un groupement.

source: Amount of physical memory to withhold from Condor (in MB):
fr: Quantité de mémoire physique à retenir pour Condor (en Mo) :

source: By default, Condor considers all the physical memory of a machine as available to be used by Condor jobs. If this value is defined, Condor subtracts it from the amount of memory it advertises as available.
fr: Condor considère par défaut que toute la mémoire physique d'une machine est disponible pour les travaux Condor. Si cette valeur est définie, elle sera soustraite à la quantité de mémoire annoncée comme étant disponible.

source: Example (to reserve 1 GB): 1024
fr: Exemple pour réserver 1 Go : 1024

source: Machines with write access to this host:
fr: Machines ayant un accès en écriture sur cet hôte :

source: All machines that are to participate in the Condor pool need to be listed here. This setting can be a plain comma-separated list, a domain with wildcards, or a macro expression. By default only localhost is allowed to access Condor daemons on this machine.
fr: Toutes les machines qui feront partie d'un groupement Condor doivent être indiquées ici. Ce paramétrage peut être une liste simple séparée par des virgules, un domaine avec des caractères génériques (« wildcards ») ou une macro. Par défaut seul l'hôte local a la permission d'accéder aux démons Condor de cette machine.

source: Example: *.condor-pool.example.org
fr: Exemple : *.groupement-condor.example.org

source: Run Condor jobs regardless of other machine activity?
fr: Faut-il exécuter les travaux de Condor malgré l'activité des autres machines ?

source: By default Condor only starts jobs when a machine is idle, i.e. no keyboard activity or CPU load for some time. Moreover, it also suspends jobs whenever there is console activity and doesn't continue them until the machine becomes idle again. However, for a dedicated compute node or a Personal Condor installation it might be desirable to always start jobs as soon as they are submitted (given that resources are still available), and to run them continuously regardless of other activity on this machine.
fr: Par défaut, Condor ne démarre des travaux que si une machine est inoccupée, c'est à dire qu'il n'y a aucune activité du clavier ou de charge du CPU pendant un certain temps. De plus, il suspend un travail quand il détecte de l'activité sur une console et ne continue que quand la machine redevient inoccupée. Toutefois, pour un nœud dédié ou une « installation personnelle de Condor », il peut être souhaitable de toujours débuter un travail dès que soumis (en supposant que les ressources soient encore disponibles) et de l'exécuter en continu indifféremment d'autres activités sur cette machine.

source: If you plan to compose a custom policy it is best to keep Condor's default here.
fr: Si vous prévoyez de créer une politique personnalisée, il est préférable de conserver la politique par défaut de Condor ici.
